src/DataProcessors/ДеревоИБ/ДеревоИБ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ДеревоИБ</name>
</mdclass:DataProcessor>

src/Catalogs/ЦентральныеСерверы/ЦентральныеСерверы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЦентральныеСерверы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>АдресRAS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортRAS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Кластеры/Кластеры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кластеры</name>
  <attributes>
    <name>АдресRAS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортRAS</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Кластеры</owners>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидХраненияАккаунта</name>
    <type>
      <types>EnumRef.ВидыХраненияАккаунтов</types>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аккаунт</name>
    <type>
      <types>CatalogRef.Аккаунты</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ДеревоИБ/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ОтображатьСкрытые.Видимость = РольДоступна("СтражПросмотрСкрытых") ИЛИ РольДоступна("ПолныеПрава");
	ОбновитьДеревоНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоИБ
&НаКлиенте
Процедура ДеревоИБВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ДеревоИБИмя Тогда
		ПоказатьЗначение(, Элементы.ДеревоИБ.ТекущиеДанные.Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоИБПриАктивизацииСтроки(Элемент)
    ОтключитьОбработчикОжидания("ОбновитьСеансы");
    ТекДанные = Элемент.ТекущиеДанные; 
    Если ТекДанные = Неопределено ИЛИ ТипЗнч(ТекДанные.Объект) <> Тип("СправочникСсылка.ИнформационныеБазы") Тогда
        Возврат;
    КонецЕсли;
    ПодключитьОбработчикОжидания("ОбновитьСеансы", 0.2, Истина);
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОбновитьДерево(Команда)
	ОбновитьДеревоНаСервере();
	СтандартныеПодсистемыКлиент.РазвернутьУзлыДерева(ЭтотОбъект, "ДеревоИБ",,Истина);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСеансы()
    ТекДанные = Элементы.ДеревоИБ.ТекущиеДанные; 
    Если ТекДанные = Неопределено ИЛИ ТипЗнч(ТекДанные.Объект) <> Тип("СправочникСсылка.ИнформационныеБазы") Тогда
        Возврат;
    КонецЕсли;
    ЗагрузитьСеансыПоИБ(ТекДанные.Объект);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСеансыПоИБ(ИБ)
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДеревоНаСервере()
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЦентральныеСерверы.Ссылка КАК Ссылка,
		|	ЦентральныеСерверы.Наименование КАК Наименование,
		|	ЦентральныеСерверы.АдресRAS КАК АдресRAS,
		|	ЦентральныеСерверы.ПортRAS КАК ПортRAS,
		|	ЦентральныеСерверы.ВидХраненияАккаунта КАК ВидХраненияАккаунта,
		|	ЦентральныеСерверы.Логин КАК Логин,
		|	ЦентральныеСерверы.Аккаунт КАК Аккаунт
		|ИЗ
		|	Справочник.ЦентральныеСерверы КАК ЦентральныеСерверы
		|ГДЕ
		|	НЕ ЦентральныеСерверы.ПометкаУдаления
		|	И НЕ ЦентральныеСерверы.ЭтоГруппа";
	
	Если Не ОтображатьСкрытые Тогда
		СхемаЗапроса = Новый СхемаЗапроса;
		СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
		Оператор = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		Оператор.Отбор.Добавить("НЕ ЦентральныеСерверы.Скрыть");
		ТекстЗапроса = СхемаЗапроса.ПолучитьТекстЗапроса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	ВыборкаЦС = Запрос.Выполнить().Выбрать();
	Дерево = РеквизитФормыВЗначение("ДеревоИБ");
	Дерево.Строки.Очистить();

	Пока ВыборкаЦС.Следующий() Цикл
		ПараметрыАдминистрированияКластера = Справочники.ЦентральныеСерверы.ПараметрыАдминистрированияКластераRAS(ВыборкаЦС);
		
		СтрокаСервера = Дерево.Строки.Добавить();
		СтрокаСервера.Имя = Строка(ВыборкаЦС.Наименование);
		СтрокаСервера.Объект = ВыборкаЦС.Ссылка;
		Кластеры = АдминистрированиеКластера.СвойстваКластеров(ПараметрыАдминистрированияКластера);
		Для Каждого Кластер Из Кластеры Цикл
			ДобавитьСтрокуКластера(СтрокаСервера, ВыборкаЦС.Ссылка, Кластер, ПараметрыАдминистрированияКластера);
		КонецЦикла;
	КонецЦикла;
	ЗначениеВРеквизитФормы(Дерево, "ДеревоИБ");
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуКластера(СтрокаСервера, СсылкаЦС, Кластер, ПараметрыАдминистрированияКластера)
	КластерОбъект = Справочники.Кластеры.ПолучитьИлиСоздатьКластерОбъект(СсылкаЦС, Кластер["name"], ОтображатьСкрытые);
	Если КластерОбъект = Неопределено Тогда // элемент скрыт
		Возврат;
	КонецЕсли;
	СтрокаКластера = СтрокаСервера.Строки.Добавить();
	СтрокаКластера.Имя = Кластер["name"];
	СтрокаКластера.Объект = КластерОбъект.Ссылка;
	
	Попытка
		ЛогинПароль = КластерОбъект.ПолучитьДанныеАутентификации();
		ПараметрыАдминистрированияКластера.ИмяАдминистратораКластера   = ЛогинПароль.Логин;
		ПараметрыАдминистрированияКластера.ПарольАдминистратораКластера = ЛогинПароль.Пароль;
		
		ИнформационныеБазы = АдминистрированиеКластера.СвойстваИнформационныхБаз(
																Кластер["cluster"],
																ПараметрыАдминистрированияКластера);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		
		СтрокаКластера.Ошибка            = Истина;
		СтрокаКластера.КартинкаСостояния = БиблиотекаКартинок.Ошибка32;
		
		Если ЭтоОшибкаАутентификацииИБ(ТекстОшибки) Тогда
			СобытиеЖР = НСтр("ru = 'ДеревоИБ.ОшибкаАутентификацииКластера'");
		Иначе
			СобытиеЖР = НСтр("ru = 'ДеревоИБ.ПолучениеИнформационныхБазКластера'");
		КонецЕсли;
		
		ЗаписьЖурналаРегистрации(СобытиеЖР,
			УровеньЖурналаРегистрации.Предупреждение,
			,
			СтрокаКластера.Объект,
			ТекстОшибки);
		
		Возврат;
	КонецПопытки;
	
	Для Каждого ИнформационнаяБаза Из ИнформационныеБазы Цикл
		ДобавитьСтрокуИнформационнойБазы(СтрокаКластера, ИнформационнаяБаза, ПараметрыАдминистрированияКластера);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьСтрокуИнформационнойБазы(СтрокаКластера, ИнформационнаяБаза, ПараметрыАдминистрированияКластера)
	ИБОбъект = Справочники.ИнформационныеБазы.ПолучитьИлиСоздатьИБОбъект(
																СтрокаКластера.Объект,
																ИнформационнаяБаза["name"],
																ОтображатьСкрытые);
	Если ИБОбъект = Неопределено Тогда // элемент скрыт
		Возврат;
	КонецЕсли;
	СтрокаИБ = СтрокаКластера.Строки.Добавить();
	СтрокаИБ.Имя    = ИБОбъект.Имя;
	СтрокаИБ.Объект = ИБОбъект.Ссылка;
	ЛогинПароль = ИБОбъект.ПолучитьДанныеАутентификации();
	
	
	ПараметрыАдминистрированияИБ = АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
	ПараметрыАдминистрированияИБ.ИмяВКластере = ИБОбъект.Имя;
	ПараметрыАдминистрированияИБ.ИмяАдминистратораИнформационнойБазы = ЛогинПароль.Логин;
	ПараметрыАдминистрированияИБ.ПарольАдминистратораИнформационнойБазы = ЛогинПароль.Пароль;
	
	Попытка
		СвойстваБлокировки = АдминистрированиеКластера.БлокировкаСеансовИЗаданийИнформационнойБазы(
																ПараметрыАдминистрированияКластера,
																ПараметрыАдминистрированияИБ);
		СтрокаИБ.БлокировкаСеанса = СвойстваБлокировки.БлокировкаСеансов;
		СтрокаИБ.ДатаС            = СвойстваБлокировки.ДатаС;
		СтрокаИБ.ДатаПо           = СвойстваБлокировки.ДатаПо;
		СтрокаИБ.БлокировкаРЗ     = СвойстваБлокировки.БлокировкаРегламентныхЗаданий;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);

		СтрокаИБ.Ошибка            = Истина;
		СтрокаИБ.КартинкаСостояния = БиблиотекаКартинок.Ошибка32;

		Если ЭтоОшибкаАутентификацииИБ(ТекстОшибки) Тогда
			СобытиеЖР = НСтр("ru = 'ДеревоИБ.ОшибкаАутентификацииИБ'");
		Иначе
			СобытиеЖР = НСтр("ru = 'ДеревоИБ.ПолучениеБлокировкиСеансов'");
		КонецЕсли;

		ЗаписьЖурналаРегистрации(СобытиеЖР,
			УровеньЖурналаРегистрации.Предупреждение,
			,
			СтрокаИБ.Объект,
			ТекстОшибки);
	КонецПопытки;
КонецПроцедуры

// Определяет, что переданный текст ошибки соответствует ошибке аутентификации
// администратора информационной базы при обращении к кластеру серверов.
//
// Параметры:
//  ТекстОшибки - Строка - подробное представление перехваченной ошибки.
//
// Возвращаемое значение:
//  Булево - Истина, если ошибка похожа на ошибку аутентификации администратора ИБ.
//
&НаСервереБезКонтекста
Функция ЭтоОшибкаАутентификацииИБ(Знач ТекстОшибки)
	ТекстНРег = НРег(ТекстОшибки);
	Маркеры = СтрРазделить(
		"administrator authentication"
		+ Символы.ПС + "administrator name and password"
		+ Символы.ПС + "authentication failed"
		+ Символы.ПС + "неверное имя или пароль"
		+ Символы.ПС + "не удалось пройти аутентификацию"
		+ Символы.ПС + "ошибка аутентификации"
		+ Символы.ПС + "аутентификация администратора",
		Символы.ПС, Ложь);
	Для Каждого Маркер Из Маркеры Цикл
		Если СтрНайти(ТекстНРег, НРег(Маркер)) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

#КонецОбласти
